In [30]:
import pandas as pd
nome = ['Joao', 'Jose', 'Antonio', 'Francisco', 'Carlos', 'Paulo', 'Pedro', 'Lucas', 'Luiz', 'Marcos',
        'Luis', 'Marcos', 'Gabriel', 'Rafael', 'Daniel', 'Marcelo', 'Bruno', 'Eduardo', 'Felipe', 'Raimundo',
        'Julia', 'Sofia', 'Rebeca', 'Raquel', 'Luana', 'Leticia', 'Alice', 'Giovana', 'Isabela', 'Ana']
idade = [18, 29, 19, 53, 31, 54, 38, 21, 24, 27,
         37, 29, 25, 35, 30, 18, 57, 33, 18, 23,
         18, 50, 22, 52, 22, 33, 22, 25, 33, 40]
genero = ['M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M',
          'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M',
          'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F',]
nota = [2, 2, 0, 6, 10, 6, 7, 3, 10, 2,
        5, 8, 8, 6, 5, 10, 1, 4, 4, 10,
        1, 2, 3, 6, 0, 5, 6, 6, 9, 4]

In [31]:
# A
dadosAlunos = {'Nome':nome, 'Idade':idade, 'Genero':genero, 'Nota':nota}

df = pd.DataFrame(dadosAlunos)
df.to_csv('dadosAlunos.csv', index=False)

In [32]:
# B
df.describe()[1:3]

          Idade      Nota
mean  31.200000  5.033333
std   11.827496  3.068003

In [33]:
# C1
df[df['Genero']=='M'].describe()[1:3]

          Idade      Nota
mean  30.950000  5.450000
std   11.962551  3.203206

In [34]:
# C2
df[df['Genero']=='F'].describe()[1:3]

          Idade      Nota
mean  31.700000  4.200000
std   12.175111  2.740641

In [35]:
# D
df.describe().loc['max']

Idade    57.0
Nota     10.0
Name: max, dtype: float64

In [48]:
# E
df.describe().loc['min']

Idade    18.0
Nota      0.0
Name: min, dtype: float64

In [59]:
# F
df.loc[df['Nota']>=7]

        Nome  Idade Genero  Nota
4     Carlos     31      M    10
6      Pedro     38      M     7
8       Luiz     24      M    10
11    Marcos     29      M     8
12   Gabriel     25      M     8
15   Marcelo     18      M    10
19  Raimundo     23      M    10
28   Isabela     33      F     9